
def greet_user(message):
    welcome_message = (
        f'<b>Салам, {message.from_user.first_name}!</b> 😊\n\n'
        '🏫 Керек центр окуу борборуна кош келиңиз! Биз сизге жогорку сапаттагы онлайн билим алуу материалдарын сунуштайбыз. '
        'Таанышуу сабагыбызга катышып көрүңүз жана өзүңүз баалаңыз.\n\n'
        '🎉 <i>Акция:</i>\n<b>Стандарт - 💸 900 сом</b> <s>1500 сом</s>\n<b>Вип - 💸 2500 сом</b> <s>3000 сом</s>\n\n'
        '<i>акция 1-мартка чейин уланат, мындай мүмкүнчүлүктү колдон чыгарбаңыз</i>\n\n'
        '――――――――――――――――\n\n'
        '<b>Стандарт тарифи:</b>\n🇰🇷 <i>- 76 сабак</i>\n💰<b>900 сом</b> <s>1500 сом</s>\n\n'
        '<b>Вип тарифи:</b>\n🇰🇷 <i>- 76 сабак + 2/7 түз эфир сабактары</i>\n💰<b>2500 сом</b> <s>3000 сом</s>\n\n'
        '<b>Премиум тарифи:</b>\n🇰🇷 <i>- 76 сабак + 2/7 түз эфир + кайтарым байланыш + тапшырмалар</i>\n💰<b>5000 сом</b>\n'
    )
    return welcome_message



bay_course =('🎉<i>Акция:</i>\n<b>Стандарт - 💸 900 сом</b> <s>1500 сом</s>\n<b>Вип - 💸 2500 сом</b> <s>3000 сом</s>\n\n'
        '<i>акция 1-мартка чейин уланат, мындай мүмкүнчүлүктү колдон чыгарбаңыз</i>')

teacher_kor = (
    '<b>👨‍🏫 Корей тили боюнча мугалим: Энес</b> 🇰🇷\n\n'
    'Энес — көп жылдык тажрыйбасы бар мугалим. Ал Кореядагы Ханбат Улуттук Университетинде корей тили жана адабияты боюнча билим алып келген. \n'
    'Энес студенттерге корей тилин тез жана эффективдүү үйрөнүүгө жардам берүү үчүн өзүнүн окуу методикасын иштеп чыкты. '
    'Бул мультимедиялык материалдарды жана реалдуу кырдаалдарды колдонуп корей тилин тез өздөштүрүүгө жардам берет.\n\n'
)



def text_tutorial(message, flag):
    text_tut = f'Бул сиздин {message} тили боюнча таанышуу видеокурсунуз. Сизге жагат деп үмүттөнөм! {flag}'
    return text_tut




