def greet_user(message):
    welcome_message = (
        f'<b>Салам, {message.from_user.first_name}!</b> 😊\n\n'
        '🏫 Керек центр окуу борборуна кош келиңиз! Биз сизге жогорку сапаттагы онлайн билим алуу материалдарын сунуштайбыз. '
        'Таанышуу сабагыбызга катышып көрүңүз жана өзүңүз баалаңыз.\n\n'
        '🎉 <b>Бүгүнкү акция:</b> Эгерде сиз бүгүн курсту сатып алсаңыз, анын баасы болгону 1999 сом болот! '
        'Мындай мүмкүнчүлүктү колдон чыгарбаңыз.\n\n'
        '<b>Биздин видео курстар:</b>\n'
        '🇰🇷 Корей тили (76сабак)\n'
        '💰 Баасы: 1999 сом\n\n'
        '🇬🇧 Англис тили (жакынкы аралыкта кошулат)\n'
        '🇷🇺 Русский тили (жакынкы аралыкта кошулат)\n'
        ' (видео курстар кыргыз тилинде жүрөт)\n'
    )
    return welcome_message

bay_course =('🎉 <b>Бүгүнкү жеңилдик:</b> Эгерде сиз бүгүн курсту сатып алсаңыз, анын баасы болгону <b>1999 сом</b> болот! \nМындай мүмкүнчүлүктү колдон чыгарбаңыз.')

teacher_kor = (
    '<b>👨‍🏫 Корей тили боюнча мугалим: Энес</b> 🇰🇷\n\n'
    'Энес — көп жылдык тажрыйбасы бар мугалим. Ал Кореядагы Ханбат Улуттук Университетинде корей тили жана адабияты боюнча билим алып келген. \n'
    'Энес студенттерге корей тилин тез жана эффективдүү үйрөнүүгө жардам берүү үчүн өзүнүн окуу методикасын иштеп чыкты. '
    'Бул мультимедиялык материалдарды жана реалдуу кырдаалдарды колдонуп корей тилин тез өздөштүрүүгө жардам берет.\n\n'
)



def text_tutorial(message, flag):
    text_tut = f'Бул сиздин {message} тили боюнча таанышуу видеокурсунуз. Сизге жагат деп үмүттөнөм! {flag}'
    return text_tut

